[{"review_id":"YnhicGrcV4hyMORkQJkjWw","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"This is a scam.  I purchased it through Groupon, and like everyone else, YOCO was a no show.","useful":0,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"o9IZjmToAnSiXTu6bgoUeQ","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"zero stars!!!!!!  no show, no callback, no email response!","useful":0,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"ENbeFNFirw9F5nT0--YQiQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Would you be extremely satisfied if your electricity provider said that they did their job just fine 99% of the time? That would mean that you will unannounced lose power and possibly also have damaged appliances 36 times a year, 1 hour each time. Well, UPS is a similar utility company that should not mess up big time few times a year. Yet, every time I receive a Saturday delivery, it is left on the side of the driveway even if it is raining heavily and even when the package is light and small. The front door and porch are well covered and just a few steps up. Only the Saturday delivery person from Lynnfield UPS does this and has in the past left obviously and visibly damaged beyond use packages on my drive way. It seems to be a problem with the Saturday delivery only indicating that the Lynnfield management (who I have notified verbally on the phone in the past) shares blame for not training their Saturday staff well even though I am sure they charge extra from the senders for Saturday deliveries.","useful":1,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"cK-3Q3YFx_iqKcKE5Gna-A","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"Definitely DON'T book with them.  I also bought a Living Social deal and have been trying to reach them for weeks.  All VM boxes are full, you cannot get a hold of them at all.  Sent an online request to contact them and haven't heard back there either.  The worst customer service.  Luckily, Living Social was able to give me credit because they were unable to contact YOCO to see what was going on.  Said there were other complaints being called in about this as well.  What a waste of time...  Wish I saw the other reviews before I bought it.","useful":1,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"ip8wjcDBu98ZT2fC5ji8Xw","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"I want to thank everyone for their reviews as it helped me quickly realize I too had been taken.  I bought the Groupon deal for 4 house cleanings.  It has now been an hour and the cleaning service has not shown.  Reading the reviews I now know they aren't coming.  I tried to reach the company and only got a voicemail.  I have contacted Groupon requesting my money back AND I have notified the BBB.  I highly recommend all of you do the same.  The public needs to know this is a scam!  Don't let others become victims too.","useful":1,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"vRuCmLywQlyIfZgDWQOaJw","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"I wish I could turn back time and stop \"back then\" me to pay money and book this company to clean my house!!! I had an appointment with them, and no one ever showed up.  I called the company and no one is answering, l left a few messages and nobody calling me back. This is a total waste of time and money! DO NOT BOOK THEM!!!  Negative 5 stars!!!","useful":1,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"IamV-oe0Txy9cae3xFvSzA","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"I would give them no stars if I could. I wish my story was different, but I unfortunately had the same experience as everyone else. Bought a Groupon for an apartment cleaning with Yoco cleaners. Made an appointment through Groupon Scheduler. I tried to confirm the appointment by telephone and by email through the companies website with no luck. Two weeks later I have had no contact with this company. All I can say is BEWARE! This is most definitely a scam!","useful":0,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"1Twp1RB4db27705Z6DLDZw","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"Just terrible!\n\nYOCO maids and cleaning had a deal on Groupon that I bought, for the first available appointment I had to wait four weeks. I booked that appointment, I received a confirmation a few days in advanced and the cleaners just did not show up! They did not call or email to cancel or reschedule this appointment, they just did not show up!\n\nI took half a day off from work for this appointment! I am extremely disappointed with Groupon for selling such scam businesses. I have been a frequent Groupon shopper now I will be more careful with them.\n\nI have been trying to contact this YOCO maids and cleaning, their toll free number just repeats a greeting message without letting me even to leave a message and their local office in Boston is just an answering machine!\n\nIn their website yoco maids and cleaning claims they work in Boston, Philadelphia, Arkansas and New York City.","useful":8,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"yQfc9mMIGWKjcb2qqXgFBw","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"I bought a Groupon for 4 apartment cleanings by YOCO maids in late October.  I went to book my first appointment and the first available was 12\/10!!!  I took the appointment despite the wait, received a confirmation email then the 10th came and went!! NO SHOW, NO CALL from YOCO maids!! I called & got a generic message & their voicemail was full! I tried several times to no avail.  I emailed them again no answer from them!  \n\nI have bought MANY Groupons in the past with no problems but I am extremely disappointed with the shoddy business practices of YOCO Maids!  The BBB will be hearing from me.  I give them ZERO stars!  Unfortunately I had to give them one to post this....","useful":1,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"QpFd95tjRFCUUvgRwietiw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Let me get this straight....so my package is just sitting at the UPS location waiting to be sent out for delivery tomorrow....but I'm not allowed to pick it up today?  Oh ok, I understand....UPS will not hold my package for pick up unless I pay to upgrade my service to UPS My Choice (for a $5 fee).  So can I please pay for the upgrade and then go and pick up my package?  No?  I can't pick up my package until TOMORROW....when it is supposed to be DELIVERED to my house tomorrow.  Someone tell me how this makes any sense at all!!!  1 star and no more!","useful":5,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"USZOxMW3o0XkYmN9FLayJw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"They didn't deliver my package on Friday December 30th because of the weather conditions.  Package left Atlanta, GA on Tuesday arrived in Massachusetts early Thursday morning, on the entire eastern board there was some ROUTINE wet snow fall Thursday night for less than an hour, this New England. Tried to pick up the package 22 miles away in Lynnfield on Sat Dec 31st but they were closed although they didn't indicate that online or when I called the 800 #.  Now they earliest I can get my juicer is January 4th. It's not like I didn't want to use  it over the long weekend and to start the new year with it.","useful":1,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"imdsiZA7VYUKFI2BTwi39A","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"The quality of service for UPS has fallen through the floor. Missed deliveries, failure to return calls or meet deadlines. Even their call center reps are surly. It's really unfortunate that a company with a reputation for customer service has so profoundly lost their way.","useful":6,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"HpUEM296mP3gwbzVbXY9MA","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I ordered a Pair of Jeans from Nordstrom directly in the store on November 24, 2018 Black Friday.  My package was processed for shipment on 11\/26\/18 with a scheduled delivery from Texas to my house in Saugus, MA on 11\/29 but because it rained here in Massachusetts UPS is said \"Recent weather has caused delivery delays.  Recovery efforts are underway to deliver your package as soon as possible.\"\n\nMy package arrive to the sorting facility next town over from me in Lynnfield MA on 11\/30\/18 and a destination scan of 12\/1\/2018.\n\nThe package was reported to being out for delivery on 12\/03\/18 at 8:07AM.  IT NEVER MADE IT.\n\nOn December 4, 2018 the package reported a \"Destination Scan\" at the Lynnfield sorting facility 1:17AM.  SO again these lazy fuckers can't deliver a simple package and held my package hostage again for another day.\n\nOn December 4, 2018 my package was scanned again as \"OUT FOR DELIVERY at 9:54AM....I waited patiently all day and even called UPS but they assured me it is coming tonight and the \"we have drivers working  until after 8pm.\n\nOn December 4, 2018 my package update alert texted me at 11:23AM \"Due to operating conditions, you package may be delayed.\/ Delivery will be rescheduled.  Lynnfield, MA.\n\nNow after seeing this I am seeing red and called UPS to report a lost and\/or stolen package because they are obviously incapbable of delivering a package and the operator tells me I have to take it up with Nordstrom. The operator then told me that she cannot do anything so I had to ask for her supervisor.  I spent 38 minutes on the phone only to be told that UPS told me that the reports are not accurate and automatically updated by the system.  So in other words my package is lost and they don't know where it is and that they are contractually unable to launch an investigation of where my package is.  So there you have it UPS SUCKS!  \nU-People Suck!","useful":4,"funny":2,"cool":0,"name":"United Parcel Service"},{"review_id":"oCR5zm7k0FSvkv7C93YylQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Person working the customer service center hare was just unpleasant. Not just to me but almost any customer whom she did not recognize as a regular customer. Even people that came in for interviews at 9am were greeted with unpleasantries. Just a simple hello would be nice.\n\nAssistance on international shipment was subpar. Was quoted one price initially and the actual cost was 4 x's that amount. I avoid The UPS store due to added fees but at least the service is much better. Will try and avoid this location...","useful":1,"funny":2,"cool":1,"name":"United Parcel Service"},{"review_id":"H4GsgRGhQzzr2tFyBc8h4Q","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I ordered a package through Amazon Prime. Expected the package to be delivered to an Amazon locker on Friday, due to the poor weather the package was delayed a day. No big deal, my USPS still delivered mail to my house but no worries, UPS isn't delivering rain, snow or shine I guess. \n\nSo the package was out for delivery today, Saturday, and all seemed fine. I receive a message. \"Your package cannot be delivered due to the fact there was nobody there to sign for the package.\" No worries, UPS usually is pretty good at fixing their mistakes and they should be able to let me pick it up at a facility or meet me somewhere. \n\nCall customer service, \"My package wasn't delivered to an Amazon Locker because I was not there to sign for it. It's a locker can I have it delivered without a signature?\" \"No.\" (Okay so there's a pause as I expect to have some additional information provided, perhaps assistance on how we can the package to me today. Nothing.) \"So can I have the package held at the facility then.\" \"Yes but you may not pick it up today.\" \"Is that facility located in such and such city?\" \"Yes in such and such city.\" (Note: The customer service agent could not be bothered to provide me with the whole address just the city so I had to search the exact location by myself.)  \n\nSuperb. What lousy customer service. So now I have to wait for items I ordered on Tuesday, that should have been here Friday, to be picked up Monday. Apparently UPS doesn't give a damn about Amazon's Prime members. Avoid UPS at all costs.\n\n*Disclaimer* This review reflects on UPS as a whole and not this location in particular. Will try to update with information on treatment by the customer service at this location on Monday.","useful":2,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"mfFw_3fiDX_YUXl3TJHRag","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"UPS is the WORSE shipping company out there!! Ordered a new cell phone through sprint online because if you go into the Sprint stores to upgrade, you will not get the same discounts and promotions off the prices and monthly lease payments! They refuse to honor them in the store. BS. So I had to wait before ordering on a day I knew I would be home to sign for the UPS package. \n\nWell UPS came to deliver my package today, 5\/1\/2019, I was home, upstairs in my house. Nobody rang the bell, and I never heard anyone knock on the door! Only an hour later did I notice the slip for attempted delivery on my front door. Tried calling sprint 4x, called UPS 4x plus the sprint reps called UPS 2x. Nobody can help me so that I can just go pick up my package at the warehouse or at an access point! Who delivers a signature required package at 1:30pm in the afternoon on a Wednesday??? People aren't usually home at that time anyways. Makes no sense! Why wouldn't they ring my doorbell then or attempt to come back later in the day?!? Now I have to wait until they attempt delivery the next 2 days when I know I will not be home to accept it because I have to work. There are restrictions on the package due to it being an expensive cell phone, I do not have any other delivery options!!! Friggen sucks. Screw YOU UPS and your shitty service! NEVER AGAIN!!!","useful":2,"funny":1,"cool":1,"name":"United Parcel Service"},{"review_id":"z42K7am6QigvQxc6mwAViQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I would give zero stars if I could to UPS. \n\nThey lied about attempts to deliver. More than once. I was inside, waiting for a driver who never showed. Then I waited outside the next day, and they swore the truck was there, but I was there, and there was no truck and no driver. \n\nI am right now on the phone waiting to speak to the supervisors supervisors manager to complain about how lousy their service is. \n\nThey refuse to leave a package without a person there to sign, but they also refuse to show up with the package for me to sign for it. \n\nThey are completely unprofessional. Do NOT use UPS, demand that your vendors switch to the POST OFFICE, which is WAY MORE COMPETENT. \n\nI have spent HOURS on the phone complaining to multiple managers at multiple locations, all of whom say they cannot do anything to help me. I am not sure why they pay these people if they cannot do their jobs. \n\nThis is a delivery company, but they cannot manage to deliver a package.","useful":11,"funny":2,"cool":0,"name":"United Parcel Service"},{"review_id":"IQa1kB0c2r8Nv176qx8HQQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Not sure what is up with this location of UPS.  Having numerous packages delivered lately for Christmas.  Packages from other UPS locations come on time, those that go through Lynnfield keep getting hung up.  One has been in Lynnfield for a week and still showing as delayed due to \"weather or natural disaster.\"  We had 2 inches of snow a week ago, hardly unusual for MA in December.  Another has shown up as \"out for delivery\" three consecutive days but never got here.\n\nSeveral others seem to have the same issue.  Something is going wrong at this location.","useful":2,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"0NFUPiXJqETFD2sGBgASXg","business_id":"GF8wA1VpmGrxGghjppLTiw","stars":1.0,"text":"I also took time of from work and YOCO were no shows... I am very disappointed in groupon for allowing such a scam.  I am shocked and have sent a request to Groupon for a refund","useful":0,"funny":0,"cool":0,"name":"YOCO Maids & Cleaning"},{"review_id":"AND4icIkuwrnq2--rPGrrw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I waited all day because I got an email that said I had to sign for my package. I live on the third floor and saw the UPS driver pull up to the door and take out my package. I went to buzz him in but he never rang. I looked outside and my 70 pound package was just left on the doorstep. Absolutely terrible service. Go FedEx.","useful":0,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"AYoZzo2jRGLqXHRxo9htPg","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":4.0,"text":"This place maybe gets a bad rep because it's out of the way and not fancy like UPS stores. For me, I value these suburban qualities: Free and easy parking, complementary dollies for heavy packages, friendly service (way beyond the cold shoulders I sadly expect these days). What's not to love? Do a little shopping in Lynnfield while you're at it.","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"8EjlcDUNtRjfnTjNX4ehMw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":5.0,"text":"Walked in, was addressed immediately, and got my package in one minute. And it's the week before Christmas. Exactly what you hope for.\n\nI'm adding this review because I think the 10 people who put reviews on here all did because they got lousy service (perfectly understandable), but there could be 1,000 other people who just picked up their package no problem but never said anything about it. I'm one of those who walked in and out. \n\nI wanted to add another perspective on here because I saw these reviews before I went, so I expected it to be like when Clarice walks past the psychos in the jail cells from Silence of the Lambs. But they were fine. (Multiple Miggs does not work there.)","useful":5,"funny":2,"cool":2,"name":"United Parcel Service"},{"review_id":"QUj3LqYWOYA0qMQGfK8Xfw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I got an email that my package was delivered. I was home when this happen. I went to get my package and it was not there. Clearly my package was delivered to someone else I am hoping it is an honest person. This should not happen.","useful":5,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"4QRs9gf7eBXHtqJ3zvpFPQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Pathetic missed deliveries all month didn't start hiring part time help until 10 days before Christmas missed payroll deliveries.  The US Postal service arrived on time.","useful":2,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"ur2U0Kjtz6jErIji6DKpVw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Worst UPS driver's ever!! They called and said the driver couldn't find my building this after being here a week earlier. Plus we have signs with the company name and address on the front door! Driver said he still couldn't find us. \n\nThey called told me I would have to come pick up the package. Use FedEx or the Post Office!","useful":7,"funny":2,"cool":1,"name":"United Parcel Service"},{"review_id":"PiFkd8zt1RO9_I7f5kyyTQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Horrible,Rude delivery man. Alright, so he rings my doorbell, I come and open the door. He says he needs a signed signature, I let my dad know the day before to sign the back of the infonotice. He doesn't want this signature for whatever reason, and all he says is \"No\". He doesn't even explain to me why he cannot accept this signature on the infonotice, then he just walks back to his truck and drives away. I had to call up the customer service to explain to me what I had experienced, and they told me that they needed a signature signed when they package is delivered. I hope this man gets fired for telling me \"No\", and not explaining anything. I refrained from cursing while writing this review. Just hope a skinny bald guy with glasses doesn't deliver a package to you.","useful":4,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"t6mZsJ6JnUGN0nxQY4RYiw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Headache... Delivery driver did not ring my buzzer or call or anything just came left a sticker and left I waited by my phone all day as the intercom calls straight to my phone as the doorbell \nwhy would I pay for 1 day shipping if they're just going to do this and I have to wait til the following Monday as it is Friday to get my stuff? No reason at all.","useful":7,"funny":2,"cool":2,"name":"United Parcel Service"},{"review_id":"deHXztpH3f5ZP76_2rxwwQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"My new iPhone arrived in a stepped on box. Thanks Ups. On top of ground shipping being half as fast and twice as expensive as priority mail from usps, they also don't care at all. \nThis was delivered from the Middleton route. The other route to my business in saugus, the driver always just leaves a \"sorry I missed you\" note and makes no attempt to deliver when my business is actually open. The drivers have 1 job. Deliver packages. That's it. And from my experience they all do it poorly.","useful":2,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"eVOCwhi0FU_i83CvW2S6Qg","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"My daughter's Xmas gift has been trapped in the Lynnfield UPS now for six days. And counting. \n\nThey just seem to scan it again every day and update the status to say: \"Due to operating conditions, your package may be delayed. \/ Your delivery has been rescheduled for the next business day.\"\n\nFor six days now?\n\nOn my second call today to UPS customer service, they assured me they've escalated the issue and I should \"keep my phone line open to receive a call between 9am and 10pm tomorrow.\" (??!)","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"V7Lb4v_Z13ZsPv4qrTs-jQ","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Very disappointed with UPS service in Lynn, MA. I live in a condo building. If I am not here when UPS tries to deliver--well, I'm just left guessing as to what happened to my package. They do not leave a note on the door, and when several days have passed on my Amazon Prime two-day delivery, it means they have left the package at a convenience store in Lynn, and I must go get it. This is happening MOST of the time, and it's very annoying! They do not leave a  note, and they do not attempt a second delivery. It's up to me to go online and track my package.","useful":3,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"KaJXGV1pxzEttar550kiCw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"The driver stopped in front of my house.  I heard him rummaging around and then he came out, opened the back door, looked in and said \"No way I can get in there, f***k it, it's not even worth it.\"  Well, it's worth it to me, it's my Christmas present from my wife.  So I called UPS Lynnfield and the recording said that due to the excessive call volume the wait time is in excess of 7 minutes.  Why am I not surprised?  So...my bottom line is \"f**k it's not even worth it\".  From now on it's FedEx or the USPS.","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"Hsm5NtwQmvqbsPE6eouhNg","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I have two packages that are over a week late. They have been out for delivery for a full week, everday starting at 9:30am. I track where the package is on the \"track my package\" page on UPS website and it comes close to my house but never delivers. Furthermore the trucks return to Lynnefield at 5:30pm when they are supposed to deliver till 8:30pm. Not only can these guys not get a package to me within a weeks timeframe from 3 miles away, but they also call their days short and go back to the headquarters to smoke butts with their buddies behind the truck rather than finish the job. Slackers..","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"3MIV1YQYbiXVwHj2hNG--w","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I don't trust UPS as far as I can spit. I had the misfortune of working a short time with them out of Norwood, MA, and I will never work or do business with them ever again.\n\nMy knees became injured during my time working as a seasonal job. They called me to work on a Saturday and I told the guy that my knees were in bad shape and I was going to see my doctor. The supervisor told me not to tell the doctor that my knees were hurt on the job! \n\nThen when I had to quit because of my knees, this company did not pay me wages for all my days of work with them. I contacted them multiple times over a year and they lied and said they'd get back to me. I even wrote to the home office in Georgia and they never replied.\n\nThe telephone numbers for this company mostly don't work. All my mailed letters to them have been ignored.\n\nThey are crooks plain and simple. I will need to bring them to court if I want my full wages.","useful":1,"funny":2,"cool":0,"name":"United Parcel Service"},{"review_id":"bNBRUxteL4nHXMm2ABX1sA","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"I order a package they said they delivered it never did,then told me they found it a week later but now two week later can not tell me where and when they can deliver it and no one from usp lynnfield has called me back","useful":0,"funny":0,"cool":1,"name":"United Parcel Service"},{"review_id":"ZghLvorlgJlhEgvkBy91XA","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Could UPS customer service be any worse? I had a delivery scheduled for 3:30-7:30 today requiring a signature. Went to their online site to waive signature, site would not permit it. Relieved an email from UPS asking if I wanted to waive signature, link did not work. Customer service couldn't help. Received an email that they had attempted delivery at 11:30 AM, 4 hours ahead of delivery window. I needed delivery today, their only option was a 1 hour window 8-9 PM. Arrived at 7:45, told I have to wait until 8:00. What a completely miserable experience.","useful":3,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"LJCVwZ5xdfN2xDsr00EZ4Q","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"First of all, don't speak to me like I am child!  I'm sorry that you had to do your job and retrieve my package from the back.  If your driver would have delivered the package when he was suppose to, I wouldn't have the pleasure of you educating me.  If 2 texts and an email tell me the package is ready to be picked up, then just give it to me without the lecture.","useful":9,"funny":4,"cool":1,"name":"United Parcel Service"},{"review_id":"SqGeTxIk_kCaJD5GdH4QWw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Just left a job interview in Lynnfield, MA.  Lisa gave myself and a gentleman a brief overview and then a tour of the facility to see exactly what we would be doing.  The job is very physical and fast paced, which is an environment I like to work in.  The whole time she had sweat practically dripped down her face, saying how hot it was.  We were just walking myself and the gentleman were fine.  I bring this up because like myself, she was a big woman.  At the end she asked to speak to me privately.  It became clear why after she started talking.  She completely 100% discriminating against me.  She kept questioning if I could do the job, it very physical and it really is a job for a man.  Hello is this 2017.  The funny thing is I saw 3 woman doing the job, one had been there 5 years.  So it's clear it's not just a man's job.  I explained I lift up packages at least 50 pounds in work.  She continued to discourage me.  When I brought up that I felt she didn't think I could do the job and obviously didn't want to hire me, I asked for the door to be unlocked to let me leave.  All of a sudden she's nice and tries to say that's not what she meant.  If I wanted a second interview to call her, shakes my hand and says it's a pleasure to meet you.  Completely back tracking because she knew she was discriminating against me.  Sent an email to headquarters and trying to get a hold of the manager of the shift, so far no luck.","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"CV-Ei2fJP2zg4fvD-05s_Q","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":5.0,"text":"I've been using the Lynnfield UPS customer counter a lot lately and I have to say they are by far the nicest women I've encountered at a UPS location... all smiles, everyday.  I've come to learn their names and have to say... Cindy, Patty and Gina are so helpful and friendly!  I won't ship any other way or at any other location!","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"ZY4YJgIfXMErW7Zki32gUw","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Insufferable customer service,\nFirst of all, its in your best interest to  advertise a local phone number to reach you instead of calling someone in the Phillipines who only reads back to you the exact shipping information you have tracked yourself.\nMay 28 - Package arrived at Lynnfield\nMay 29-  Package out for delivery\nMay 30 & 31- Package due to arrive  June 01\nJune 01- Package arrived at Lynnfield.\nJune 02- Package  running late -   later in day out for delivery\nJune 03-  Package may be lost\nA resounding WHAT ?????\nJune 04- Call your lovely outsourched Phillipibes helpers only be told that instead of being transferred to you directly, I need to contact Amazon and file a claim with THEM ?   How in the world is this Amazons problem ???  They sent it to you, you received it and have been doing I have no idea WHAT with it for over a week.\nThis isn't lost.. this is lazy.","useful":2,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"zjPKqvtTlM7c8h3-5rj3OA","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":3.0,"text":"Everytime I go into the branch the people have been great.  When I've gotten a call back from the branch because corporate customer service can't help, they've been great.  My problem is that 8 out of 10 times UPS can't find my address.  I  have a half for my street number so I can see some difficulty but it's almost always the same problem and idk if it's something that happens at this branch or the first one who touches the package.  Basically they slap on a new address label that has a completely different address from my actual one.  I was told when they type mine in for the new label it'll sort of auto correct(can't remember the actual words used but this is basically it) and that's where they deliver to.  Fortunately and unfortunately the address they end up using doesn't even exist in my city.  You'd think someone along the way would notice that there are 2 different addresses on the package, the correct one from where I ordered and their wrong one.  The UPS label usually is smaller than the store label.  I do eventually get my package, with a couple of exceptions, but it is quite frustrating and nerve wracking when the package is time sensitive.","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"xVdZGZ6idIHUAih351Dhew","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"My package is being held hostage in the Lynnfield,Ma office. Driver scans attempted but never drives to where I live furthermore he won't leave if I'm not home. I live in senior housing in a secure area and I'm told it's the driver's discretion whether or not to leave it inside the building? Supervisor does not call back!  Why shop on line if I can't get it delivered, so we cancelled our prime account Amazon was not happy and are looking into it.","useful":0,"funny":0,"cool":0,"name":"United Parcel Service"},{"review_id":"BrZ6iz7CngBqJBAIpDDepA","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Needed a package by Sunday, was delivered to this location on Friday and left there, called Saturday to come pick up myself, they would not let me. This place is a joke.","useful":1,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"-YUbd74Zf_x7QtDOeibptg","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"UPS was scheduled to make a delivery of an important piece of equipment to my home office. As per the tracking number, the delivery would be made by 10:15AM. The day before on the UPS customer site I created an electronic signature, and to double check, spoke to a customer representative. I was told that because I requested an electronic delivery signature, that the equipment would be left without need of my physical signature. This morning I found a note taped to my door that the delivery could not be made as I was not available to sign. The fact is that no one rang my bell and waited for me to answer the door! I immediately contacted UPS and a different representative said that what the rep told me yesterday was not true; that I did need to sign; the rep also told me that the delivery person is NOT REQUIRED to wait for me to answer the door NOR TO RETURN TO MY OFFICE! I explained that this was important and I could not do my job today without it, but received the usual non-caring response that the delivery would be 'attempted' again tomorrow, or I could travel 40 miles after 7:00PM to pick the equipment up myself which still left me with UPS holding my equipment for another day. So I lost a day's work thanks to UPS. Unfortunately for me, I had no choice in the delivery option as the company automatically uses this useless United Parcel Service, which is no service at all.","useful":2,"funny":1,"cool":0,"name":"United Parcel Service"},{"review_id":"SG1sWUyuOgbpy3v1q7Bo0g","business_id":"NJXvZ25bka5hHEPa3PmJVA","stars":1.0,"text":"Was contacted by location last night to come on Saturday between 10-1 but it's 11am and still no one at this Lynnfield Customer Center location to open door. Several others here in same boat. Awful experience.","useful":2,"funny":0,"cool":0,"name":"United Parcel Service"}]